package HW_3

/**
 * На вход программы приходит информация о списочном составе 11 класса в школе в виде списка списков
 * (пример: [["Петров Петр", "Иванов Иван", "Сидоров Сидр"],["Марианова Мария", "Иваненко Иванен"],
 * ["Лев Львов"]]). Во входных данных также содержится информация о поле учеников,
 * а также о том об отношении "нравится"
 * (пример: "Марианова Мария", ж, нравится: ["Петров Петр", "Лев Львов"]).
Программа призвана помогать учителям снижать отвлекающий фактор при подготовке к экзаменам.
В качестве результат программа выдает такое разбиение по классам,
что для каждого ученика минимизируется количество одноклассников, которые бы ему "нравились".
 */
